### Opening and creating different tables

In [1]:
import pandas as pd
import numpy as np
import os
import warnings
warnings.filterwarnings('ignore')

In [2]:
hr_dataset = pd.read_csv('data/HR_dataset/HR_Dataset_clean.csv', index_col=0)
pd.options.display.max_columns = None
hr_dataset.head(2)

,Employee_Name,EmpID,Married,MaritalStatusID,GenderID,EmpStatusID,DeptID,PerfScoreID,FromDiversityJobFairID,Salary,Term,PositionID,Position,State,Zip,DOB,Sex,MaritalDesc,CitizenDesc,HispanicLatino,RaceDesc,DateofHire,DateofTermination,TermReason,EmploymentStatus,Department,ManagerName,ManagerID,RecruitmentSource,PerformanceScore,EngagementSurvey,EmpSatisfaction,SpecialProjectsCount,LastPerformanceReview_Date,DaysLateLast30,Absences
0,"Adinolfi, Wilson K",10026,No,0,1,1,5,4,No,62506,No,19,Production Technician I,MA,1960,1983-07-10,M,Single,US Citizen,No,White,2011-07-05,NaN,N/A-StillEmployed,Active,Production,Michael Albert,22,LinkedIn,Exceeds,4.60,5,0,2019-01-17,0,1
1,"Ait Sidi, Karthikeyan",10084,Yes,1,1,5,3,3,No,104437,Yes,27,Sr. DBA,MA,2148,1975-05-05,M,Married,US Citizen,No,White,2015-03-30,2016-06-16,career change,Voluntarily Terminated,IT/IS,Simon Roup,4,Indeed,Fully Meets,4.96,3,6,2016-02-24,0,17

Splitting information:
- Creating working profile
- Creating personal profile table
- Creating recruitment table
- Creating performance table
- Creating engagement table
- Creating absenteeism table
- Creating attrition table
- Creating department table
- Creating position table
- Creating manager table
- Creating marital_status table
- Creating gender table

In [3]:
hr_dataset.columns

Index(['Employee_Name', 'EmpID', 'Married', 'MaritalStatusID', 'GenderID',
       'EmpStatusID', 'DeptID', 'PerfScoreID', 'FromDiversityJobFairID',
       'Salary', 'Term', 'PositionID', 'Position', 'State', 'Zip', 'DOB',
       'Sex', 'MaritalDesc', 'CitizenDesc', 'HispanicLatino', 'RaceDesc',
       'DateofHire', 'DateofTermination', 'TermReason', 'EmploymentStatus',
       'Department', 'ManagerName', 'ManagerID', 'RecruitmentSource',
       'PerformanceScore', 'EngagementSurvey', 'EmpSatisfaction',
       'SpecialProjectsCount', 'LastPerformanceReview_Date', 'DaysLateLast30',
       'Absences'],
      dtype='object')

In [4]:
# Creating a dictionaire with the table names as keys and the columns of the original dataframe as values:
col_table = {'working_profile': ['EmpID', 'Term', 'EmploymentStatus', 'DateofHire', 'DateofTermination', 'Salary', 'Department', 'Position', 'ManagerID', 'SpecialProjectsCount'],
            'personal_profile': ['EmpID', 'Employee_Name', 'DOB', 'MaritalStatusID','GenderID', 'FromDiversityJobFairID', 'CitizenDesc', 'RaceDesc', 'HispanicLatino', 'State', 'Zip'],
            'recruitment': ['EmpID', 'RecruitmentSource'],
            'performance_employee': ['EmpID', 'LastPerformanceReview_Date', 'PerformanceScore'],
            'engagement': ['EmpID', 'EngagementSurvey', 'EmpSatisfaction'],
            'absenteeism': ['EmpID', 'DaysLateLast30', 'Absences'],
            'attrition': ['EmpID', 'EmploymentStatus', 'DateofTermination', 'TermReason'],
            'manager': ['ManagerID', 'ManagerName'],
            'marital_status': ['MaritalStatusID', 'MaritalDesc', 'Married'],
            'gender': ['GenderID', 'Sex']}

In [5]:
# creating a csv for each table of the dictionaire:
base_directory = 'data/HR_dataset/'
os.makedirs(base_directory, exist_ok= True)
dataframes_dict = {}

for table_name, columns in col_table.items():
    dataframe = hr_dataset[columns]
    dataframes_dict[table_name] = hr_dataset[columns]
    output_path = os.path.join(base_directory, f"{table_name}.csv")
    dataframe.to_csv(output_path, index=False)

for table_name, dataframe in dataframes_dict.items():
    globals()[table_name] = dataframe

___
Cleaning the new global tables:

In [6]:
manager.drop_duplicates(inplace= True)
manager.sort_values('ManagerID')

     ManagerID         ManagerName
29           1  Brandon R. LeBlanc
27           2          Janet King
26           3  Brandon R. LeBlanc
1            4          Simon Roup
35           5     Jennifer Zamora
48           6        Eric Dougall
9            7        Peter Monroe
97           9  Board of Directors
6           10     Alex Sweetwater
5           11            Amy Dunn
8           12      Brannon Miller
70          13    Brian Champaigne
10          14       David Stanley
60          15      Debra Houlihan
3           16        Elijiah Gray
32          17          John Smith
13          18       Kelley Spirea
7           19       Ketsia Liebig
2           20      Kissy Sullivan
45          21       Lynn Daneault
0           22      Michael Albert
129         30      Michael Albert
4           39      Webster Butler

In [7]:
manager.to_csv('data/HR_dataset/manager.csv', index=False)

In [8]:
gender.drop_duplicates(inplace= True)
gender.sort_values('GenderID')

   GenderID Sex
2         0   F
0         1  M

In [9]:
gender.to_csv('data/HR_dataset/gender.csv', index=False)

In [10]:
marital_status.drop_duplicates(inplace= True)
marital_status.sort_values('MaritalStatusID')

    MaritalStatusID MaritalDesc Married
0                 0      Single      No
1                 1     Married     Yes
4                 2    Divorced      No
31                3   Separated      No
7                 4     Widowed      No

In [11]:
marital_status.to_csv('data/HR_dataset/marital_status.csv', index=False)

In [12]:
attrition.head()

   EmpID        EmploymentStatus DateofTermination         TermReason
0  10026                  Active               NaN  N/A-StillEmployed
1  10084  Voluntarily Terminated        2016-06-16      career change
2  10196  Voluntarily Terminated        2012-09-24              hours
3  10088                  Active               NaN  N/A-StillEmployed
4  10069  Voluntarily Terminated        2016-09-06   return to school

In [13]:
attrition = attrition[attrition["EmploymentStatus"] != "Active"]

In [14]:
attrition.to_csv('data/HR_dataset/attrition.csv', index=False)

___
#### Let's create now the "roster" table:

In [18]:
mid = hr_dataset[['EmpID', 'DateofHire', 'DateofTermination']]

In [20]:
mid_max_date = pd.DataFrame(mid['DateofTermination'].fillna('1999-01-01'))

In [21]:
calendar = pd.DataFrame(pd.date_range(min(mid['DateofHire']), max(mid_max_date['DateofTermination'])), columns=['Date'])

Let's create now a new dataframe with a row for each date-employee:

In [25]:
calendar['key'] = 1
mid['key'] = 1

#Creating the roster
roster = pd.merge(calendar, mid, how= 'outer', on='key').drop('key', axis= 1)

In [26]:
roster[["DateofHire", "DateofTermination"]] = roster[["DateofHire", "DateofTermination"]].astype('datetime64[ns]')

In [28]:
def status(row):
    if row['Date'] < row['DateofHire'] or row['Date'] > row['DateofTermination']:
        return 'No active'
    else:
        return 'Active'

roster['Status'] = roster.apply(status, axis= 1)

In [30]:
roster = roster[roster['Status'] != "No active"].drop("Status", axis= 1)

In [32]:
roster.to_csv('data/HR_dataset/roster.csv')

___
#### For Database creation, let's create the column type (database creation in jupyter `3.Creating_SQL_database`)

In [15]:
# checking types:
col_types = hr_dataset.dtypes.reset_index()
col_types[0]

0      object
1       int64
2      object
3       int64
4       int64
5       int64
6       int64
7       int64
8      object
9       int64
10     object
11      int64
12     object
13     object
14      int64
15     object
16     object
17     object
18     object
19     object
20     object
21     object
22     object
23     object
24     object
25     object
26     object
27      int64
28     object
29     object
30    float64
31      int64
32      int64
33     object
34      int64
35      int64
Name: 0, dtype: object

In [16]:
def conv_sql_type_custom(value):
    if value == 'object':
        return 'VARCHAR(255)'
    elif value == 'int64':
        return 'INT'
    elif value == 'float64':
        return 'FLOAT'
    else:
        return value

col_types['SQL_conv'] = col_types[0].apply(conv_sql_type_custom)

In [17]:
col_types.to_csv('data/HR_dataset/conversion_sql')